#pragma once

#include "phnt_windows.h"
#include "phnt.h"
#include "Hash.h"
#include <malloc.h>
#include <stdio.h>
#include <wchar.h>
#include <intrin.h>
#include <shlwapi.h>
#include <limits>
#include <intsafe.h>
#include <new>

#define INLINE_ASM __asm

#define MEMORY_PAGE_SIZE (4 * 1024)

#define DEF_VAL(var, value)  var = value

#define TYPE_OF decltype
#define FUNC_POINTER(__func) TYPE_OF(__func)*
#define API_POINTER(__func) TYPE_OF(&__func)
#define PTR_OF(_var) TYPE_OF(_var)*

#define FOR_EACH(_it, _base, _n) for (auto _Count = ( ((_it) = (_base)), (_n)); _Count != 0; ++(_it), --_Count)
#define FOR_EACH_REVERSE(_it, _base, _n) for (auto _Count = ( ((_it) = (_base) + (_n) - 1), (_n)); _Count != 0; --(_it), --_Count)
#define FOR_EACH_ARRAY(_it, _arr) FOR_EACH(_it, _arr, countof(_arr))
#define FOR_EACH_S(_it, _base, _n, _size) for (auto _Count = ( ((_it) = (_base)), (_n)); _Count != 0; ((_it) = PtrAdd(_it, _size)), --_Count)
#define FOR_EACH_X(_it, _base, _n) for (auto _Count = ( ((_it) = (_base)), (_n); _Count != 0; ++(_it), --(_n), --_Count)

#define FOR_EACH_FORWARD(_it, _n) { (_it) += (_n); (_Count) += (_n); }
#define FOR_EACH_BACKWARD(_it, _n) { (_it) -= (_n); (_Count) -= (_n); }



#if !defined(_68K_) && !defined(_MPPC_) && !defined(_X86_) && !defined(_IA64_) && !defined(_AMD64_) && defined(_M_IX86)
#define _X86_
#endif

#if !defined(_68K_) && !defined(_MPPC_) && !defined(_X86_) && !defined(_IA64_) && !defined(_AMD64_) && defined(_M_AMD64)
#define _AMD64_
#endif

#if !defined(_68K_) && !defined(_MPPC_) && !defined(_X86_) && !defined(_IA64_) && !defined(_AMD64_) && defined(_M_M68K)
#define _68K_
#endif

#if !defined(_68K_) && !defined(_MPPC_) && !defined(_X86_) && !defined(_IA64_) && !defined(_AMD64_) && defined(_M_MPPC)
#define _MPPC_
#endif

#if !defined(_68K_) && !defined(_MPPC_) && !defined(_X86_) && !defined(_M_IX86) && !defined(_AMD64_) && defined(_M_IA64)
#if !defined(_IA64_)
#define _IA64_
#endif /* !_IA64_ */
#endif

#ifndef _MAC
#if defined(_68K_) || defined(_MPPC_)
#define _MAC
#endif
#endif /* _MAC */

#if defined(_AMD64_)

#define MY_X64 1
#define ML_AMD64    1

#elif defined(_X86_)

#define ML_X86 1
#define ML_I386 1

#endif



#ifndef ASM
#define ASM __declspec(naked)
#endif /* ASM */

#ifndef NAKED
#define NAKED __declspec(naked)
#endif /* ASM */

#if !defined(INLINE_ASM)
#define INLINE_ASM __asm
#endif /* INLINE_ASM */

#ifndef MY_DLL_EXPORT
#define MY_DLL_EXPORT __declspec(dllexport)
#endif  /* MY_DLL_EXPORT */

#ifdef _MY_NTLIB_DLL_
#define MY_NTLIB_DLL_EXPORT __declspec(dllexport)
#else
#define MY_NTLIB_DLL_EXPORT
#endif  /* _MY_NTLIB_DLL_ */

#ifndef MY_DLL_IMPORT
#define MY_DLL_IMPORT __declspec(dllimport)
#endif /* MY_DLL_IMPORT */

#define SEH_TRY     __try
#define SEH_FINALLY __finally
#define SEH_LEAVE   __leave
#define SEH_EXCEPT  __except

#define DECL_NOVTABLE   __declspec(novtable)


#if !defined(MIN)
#define MIN(a, b) a < b ? a : b
#endif

#if !defined(MAX)
#define MAX(a, b) a > b ? a : b
#endif



template<class T>
inline void SafeReleaseT(T*& Object)
{
	if (Object != NULL)
	{
		Object->Release();
		Object = NULL;
	}
}

template<class T>
inline void SafeDeleteT(T*& Object)
{
	if (Object != NULL)
	{
		delete Object;
		Object = NULL;
	}
}

template<class T>
inline void SafeDeleteArrayT(T*& Object)
{
	if (Object != NULL)
	{
		delete[] Object;
		Object = NULL;
	}
}


namespace PointerOperationType
{
	enum PointerOperationClass
	{
		POINTER_OP_ADD,
		POINTER_OP_SUB,
		POINTER_OP_AND,
		POINTER_OP_OR,
		POINTER_OP_XOR,
		POINTER_OP_MOD,
	};
}


template<PointerOperationType::PointerOperationClass OP, class PtrType1, class PtrType2>
FORCEINLINE
PtrType1 PtrOperator(PtrType1 Ptr1, PtrType2 Ptr2)
{
#pragma warning(push, 0)
	struct
	{
		union
		{
			PtrType1        _Ptr1;
			LARGE_INTEGER   Value1;
		};

		union
		{
			PtrType2        _Ptr2;
			LARGE_INTEGER   Value2;
		};
	} u;

#pragma warning(push)
#pragma warning(disable:4702)

	if (MAX(sizeof(Ptr1), sizeof(Ptr2)) == sizeof(u.Value1.QuadPart))
	{
		u.Value1.QuadPart = 0;
		u.Value2.QuadPart = 0;
	}
	else
	{
		u.Value1.LowPart = NULL;
		u.Value2.LowPart = NULL;
	}

#pragma warning(pop)

	u._Ptr1 = Ptr1;
	u._Ptr2 = Ptr2;

	if (MAX(sizeof(Ptr1), sizeof(Ptr2)) == sizeof(u.Value1.QuadPart))
	{
		switch (OP)
		{
		case PointerOperationType::POINTER_OP_ADD:
			u.Value1.QuadPart += u.Value2.QuadPart;
			break;

		case PointerOperationType::POINTER_OP_SUB:
			u.Value1.QuadPart -= u.Value2.QuadPart;
			break;

		case PointerOperationType::POINTER_OP_AND:
			u.Value1.QuadPart &= u.Value2.QuadPart;
			break;

		case PointerOperationType::POINTER_OP_OR:
			u.Value1.QuadPart |= u.Value2.QuadPart;
			break;

		case PointerOperationType::POINTER_OP_XOR:
			u.Value1.QuadPart ^= u.Value2.QuadPart;
			break;

		case PointerOperationType::POINTER_OP_MOD:
			u.Value1.QuadPart %= u.Value2.QuadPart;
			break;
		}
	}
	else
	{
		switch (OP)
		{
		case PointerOperationType::POINTER_OP_ADD:
			u.Value1.LowPart += u.Value2.LowPart;
			break;

		case PointerOperationType::POINTER_OP_SUB:
			u.Value1.LowPart -= u.Value2.LowPart;
			break;

		case PointerOperationType::POINTER_OP_AND:
			u.Value1.LowPart &= u.Value2.LowPart;
			break;

		case PointerOperationType::POINTER_OP_OR:
			u.Value1.LowPart |= u.Value2.LowPart;
			break;

		case PointerOperationType::POINTER_OP_XOR:
			u.Value1.LowPart ^= u.Value2.LowPart;
			break;

		case PointerOperationType::POINTER_OP_MOD:
			u.Value1.LowPart %= u.Value2.LowPart;
			break;
		}
	}

#pragma warning(pop)

	return u._Ptr1;
}

template<PointerOperationType::PointerOperationClass OP, class PtrType1>
FORCEINLINE
PtrType1 PtrOperator(PtrType1 Ptr1, unsigned short Ptr2)
{
	return PtrOperator<OP>(Ptr1, (ULONG_PTR)Ptr2);
}

template<PointerOperationType::PointerOperationClass OP, class PtrType1>
FORCEINLINE
PtrType1 PtrOperator(PtrType1 Ptr1, short Ptr2)
{
	return PtrOperator<OP>(Ptr1, (ULONG_PTR)Ptr2);
}

template<PointerOperationType::PointerOperationClass OP, class PtrType1>
FORCEINLINE
PtrType1 PtrOperator(PtrType1 Ptr1, unsigned char Ptr2)
{
	return PtrOperator<OP>(Ptr1, (ULONG_PTR)Ptr2);
}

template<PointerOperationType::PointerOperationClass OP, class PtrType1>
FORCEINLINE
PtrType1 PtrOperator(PtrType1 Ptr1, char Ptr2)
{
	return PtrOperator<OP>(Ptr1, (ULONG_PTR)Ptr2);
}

template<class PtrType1, class PtrType2>
FORCEINLINE
ULONG_PTR PtrOffset(PtrType1 Ptr, PtrType2 Offset)
{
#pragma warning(push, 0)
	union
	{
		PtrType1    _Ptr1;
		ULONG_PTR   Value;
	};
#pragma warning(pop)

	_Ptr1 = Ptr;

	return PtrOperator<PointerOperationType::POINTER_OP_SUB>(Value, Offset);
}

template<class PtrType1, class PtrType2>
FORCEINLINE
PtrType1 PtrAdd(PtrType1 Ptr, PtrType2 Offset)
{
	return PtrOperator<PointerOperationType::POINTER_OP_ADD>(Ptr, Offset);
}

template<class PtrType1, class PtrType2>
FORCEINLINE
PtrType1 PtrSub(PtrType1 Ptr, PtrType2 Offset)
{
	return PtrOperator<PointerOperationType::POINTER_OP_SUB>(Ptr, Offset);
}

template<class PtrType1, class PtrType2>
FORCEINLINE
PtrType1 PtrAnd(PtrType1 Ptr, PtrType2 Offset)
{
	return PtrOperator<PointerOperationType::POINTER_OP_AND>(Ptr, Offset);
}

template<class PtrType1, class PtrType2>
FORCEINLINE
PtrType1 PtrOr(PtrType1 Ptr, PtrType2 Offset)
{
	return PtrOperator<PointerOperationType::POINTER_OP_OR>(Ptr, Offset);
}

template<class PtrType1, class PtrType2>
FORCEINLINE
PtrType1 PtrXor(PtrType1 Ptr, PtrType2 Offset)
{
	return PtrOperator<PointerOperationType::POINTER_OP_XOR>(Ptr, Offset);
}

template<class PtrType1, class PtrType2>
FORCEINLINE
PtrType1 PtrMod(PtrType1 Ptr, PtrType2 Offset)
{
	return PtrOperator<PointerOperationType::POINTER_OP_MOD>(Ptr, Offset);
}


#define DR7_LEN_1_BYTE  1
#define DR7_LEN_2_BYTE  2
#define DR7_LEN_4_BYTE  3
#define DR7_RW_EXECUTE  0
#define DR7_RW_WRITE    1
#define DR7_RW_ACCESS   3


#define RTL_DUPLICATE_UNICODE_STRING_NULL_TERMINATE             (0x00000001)
#define RTL_DUPLICATE_UNICODE_STRING_ALLOCATE_NULL_STRING       (0x00000002)
#define RTL_DUPSTR_ADD_NULL                                     RTL_DUPLICATE_UNICODE_STRING_NULL_TERMINATE
#define RTL_DUPSTR_ALLOC_NULL                                   RTL_DUPLICATE_UNICODE_STRING_ALLOCATE_NULL_STRING

#pragma pack(1)

typedef union
{
	ULONG Dr6;
	struct
	{
		BYTE B0 : 1;
		BYTE B1 : 1;
		BYTE B2 : 1;
		BYTE B3 : 1;
		BYTE Reserve1 : 8;
		BYTE Reserve2 : 2;
		BYTE BD : 1;
		BYTE BS : 1;
		BYTE BT : 1;
	};

} DR6_INFO, *PDR6_INFO;

typedef union
{
	ULONG Dr7;
	struct
	{
		BYTE L0 : 1;    // 0x01
		BYTE G0 : 1;    // 0x02
		BYTE L1 : 1;    // 0x03
		BYTE G1 : 1;    // 0x04
		BYTE L2 : 1;    // 0x05
		BYTE G2 : 1;    // 0x06
		BYTE L3 : 1;    // 0x07
		BYTE G3 : 1;    // 0x08
		BYTE LE : 1;    // 0x09
		BYTE GE : 1;    // 0x0A
		BYTE Reserve : 3;    // 0x0B
		BYTE GD : 1;    // 0x0E
		BYTE Reserve2 : 2;    // 0x0F
		BYTE RW0 : 2;    // 0x11
		BYTE LEN0 : 2;    // 0x13
		BYTE RW1 : 2;    // 0x15
		BYTE LEN1 : 2;    // 0x17
		BYTE RW2 : 2;    // 0x19
		BYTE LEN2 : 2;    // 0x1B
		BYTE RW3 : 2;    // 0x1D
		BYTE LEN3 : 2;    // 0x1F
	};
} DR7_INFO, *PDR7_INFO;

typedef struct
{
	ULONG_PTR Rdi;
	ULONG_PTR Rsi;
	ULONG_PTR Rbp;
	ULONG_PTR Rsp;
	ULONG_PTR Rbx;
	ULONG_PTR Rdx;
	ULONG_PTR Rcx;
	ULONG_PTR Rax;

} PUSHAD_REGISTER, *PPUSHAD_REGISTER;


typedef union
{
	struct
	{
		UINT16 w1;
		UINT16 w2;
		UINT16 w3;
		UINT16 w4;
		UINT16 w5;
		UINT16 w6;
		UINT16 w7;
		INT16  w8;
	};

	struct
	{
		UINT32 d1;
		UINT32 d2;
		UINT32 d3;
		INT32  d4;
	};

	struct
	{
		ULARGE_INTEGER q1;
		LARGE_INTEGER  q2;
	};
} MMXRegister;

#pragma pack()

#define RTL_CONST_STRING(_str, _string) \
            (_str).Length = sizeof(_string) - sizeof((_str).Buffer[0]); \
            (_str).MaximumLength = sizeof(_string); \
            (_str).Buffer = (_string);

template<typename StringType>
inline
VOID
RtlInitEmptyString(
	OUT StringType*     String,
	IN  PCWSTR          Buffer = nullptr,
	IN  ULONG_PTR       BufferSize = 0
)
{
	String->Length = 0;
	String->MaximumLength = (USHORT)BufferSize;
	String->Buffer = (PWSTR)Buffer;
}

enum // ECodePage
{
	CP_SHIFTJIS = 932,
	CP_GBK = 936,
	CP_GB2312 = CP_GBK,
	CP_BIG5 = 950,
	CP_UTF16_LE = 1200,
	CP_UTF16_BE = 1201,
};

#define BOM_UTF8        (UInt32)(0xBFBBEF)
#define BOM_UTF16_LE    (UInt16)(0xFEFF)
#define BOM_UTF16_BE    (UInt16)(0xFFFE)

INT32 StringToInt32A(PCCHAR pszString);
INT32 StringToInt32W(PCWCHAR pszString);

inline INT32 StringToInt32(TCHAR* pszString)
{
	if (sizeof(*pszString) == sizeof(CHAR))
		return StringToInt32A((PCHAR)pszString);
	else
		return StringToInt32W((PWCHAR)pszString);
}

INT32 StringToInt32HexW(PCWCHAR pszString);
INT64 StringToInt64HexW(PCWCHAR pszString);
INT64 StringToInt64A(PCHAR pszString);
INT64 StringToInt64W(PCWCHAR pszString);

inline INT64 StringToInt64(TCHAR* pszString)
{
	if (sizeof(TCHAR) == sizeof(CHAR))
		return StringToInt64A((PCHAR)pszString);
	else if (sizeof(TCHAR) == sizeof(WCHAR))
		return StringToInt64W((PWCHAR)pszString);

	return 0;
}

#define __MAKE_WSTRING(str) L##str
#define MAKE_WSTRING(str) __MAKE_WSTRING(str)



#define ASM_UNIQUE() INLINE_ASM mov eax, __LINE__

#define ASM_DUMMY(Bytes) ASM_DUMMY_##Bytes

#define ASM_DUMMY_1 INLINE_ASM nop
#define ASM_DUMMY_2 INLINE_ASM mov eax, eax

// lea eax, [eax+0];
#define ASM_DUMMY_3 INLINE_ASM __emit 0x8D INLINE_ASM __emit 0x40 INLINE_ASM __emit 0x00

// // lea esi, [esi]
#define ASM_DUMMY_4 INLINE_ASM __emit 0x8D \
                    INLINE_ASM __emit 0x74 \
                    INLINE_ASM __emit 0x26 \
                    INLINE_ASM __emit 0x00

#define ASM_DUMMY_5 INLINE_ASM mov eax, 1
#define ASM_DUMMY_6 INLINE_ASM __emit 0x8D INLINE_ASM __emit 0x80 INLINE_ASM __emit 0x00 INLINE_ASM __emit 0x00 INLINE_ASM __emit 0x00 INLINE_ASM __emit 0x00

#define ASM_DUMMY_7 INLINE_ASM __emit 0x8D \
                    INLINE_ASM __emit 0xB4 \
                    INLINE_ASM __emit 0x26 \
                    INLINE_ASM __emit 0x00 \
                    INLINE_ASM __emit 0x00 \
                    INLINE_ASM __emit 0x00 \
                    INLINE_ASM __emit 0x00

#define ASM_DUMMY_AUTO() INLINE_ASM mov eax, 1 INLINE_ASM mov ecx, 1 INLINE_ASM mov edx, 1 ASM_UNIQUE() INLINE_ASM ret

#define LOOP_ALWAYS for (;;)
#define LOOP_FOREVER LOOP_ALWAYS
#define LOOP_ONCE   for (BOOL __condition_ = TRUE; __condition_; __condition_ = FALSE)


#if !defined(BREAK_IF)
#define BREAK_IF(c) if (c) break;
#endif /* BREAK_IF */


#if !defined(CONTINUE_IF)
#define CONTINUE_IF(c) if (c) continue;
#endif /* CONTINUE_IF */

#if !defined(RETURN_IF)
#define RETURN_IF(c, r) if (c) return r
#endif /* RETURN_IF */

#if !defined(countof)
#define countof(x) (sizeof((x)) / sizeof(*(x)))
#endif /* countof */

#if !defined(CONST_STRLEN)
#define CONST_STRLEN(str) (countof(str) - 1)
#define CONST_STRSIZE(str) (CONST_STRLEN(str) * sizeof(str[0]))
#endif // CONST_STRLEN

#if !defined(bitsof)
#define bitsof(x) (sizeof(x) * 8)
#endif /* bitsof */

#define FIELD_BASE(address, type, field) (type *)((ULONG_PTR)address - (ULONG_PTR)&((type *)0)->field)
#define FIELD_TYPE(_Type, _Field)  TYPE_OF(((_Type*)0)->_Field)

#ifndef FIELD_SIZE
#define FIELD_SIZE(type, field) (sizeof(((type *)0)->field))
#endif // FIELD_SIZE

#define SET_FLAG(_V, _F)    ((_V) |= (_F))
#define CLEAR_FLAG(_V, _F)  ((_V) &= ~(_F))
#define FLAG_ON(_V, _F)     (!!((_V) & (_F)))
#define FLAG_OFF(_V, _F)     (!FLAG_ON(_V, _F))

#if !defined(TEST_BIT)
#define TEST_BIT(value, bit) ((value) & (1 << bit))
#endif /* TEST_BIT */

#if !defined(ROUND_DOWN)
#define ROUND_DOWN(Value, Multiple) ((Value) / (Multiple) * (Multiple))
#endif /* ROUND_DOWN */

#if !defined(ROUND_UP)
#define ROUND_UP(Value, Multiple) (ROUND_DOWN((Value) + (Multiple) - 1, (Multiple)))
#endif /* ROUND_UP */

#if !defined(IN_RANGE)
#define IN_RANGE(low, value, high) (((low) <= (value)) && (value) <= (high))
#define IN_RANGEEX(low, value, high) (((low) <= (value)) && (value) < (high))
#endif

#define NOP  0x90
#define CALL 0xE8
#define JUMP 0xE9
#define PUSH 0x68
#define REXW 0x49

template<class FunctionType, class FunctionAddress>
__forceinline
FunctionType GetRoutinePtr(FunctionType, FunctionAddress Address)
{
	union
	{
		FunctionType    _Addr1;
		FunctionAddress _Addr2;
	};

	_Addr2 = Address;

	return _Addr1;
}


#define CHAR_UPPER(ch) (IN_RANGE('a', (ch), 'z') ? ((ch) & (BYTE)0xDF) : ch)
#define CHAR_LOWER(ch) (IN_RANGE('A', (ch), 'Z') ? ((ch) | (BYTE)~0xDF) : ch)

#define _CHAR_UPPER4W(ch) (UINT64)((ch) & 0xFFDFFFDFFFDFFFDF)
#define CHAR_UPPER4W(ch) _CHAR_UPPER4W((UINT64)(ch))
#define CHAR_UPPER3W(ch) (UINT64)(CHAR_UPPER4W(ch) & 0x0000FFFFFFFFFFFF)
#define CHAR_UPPER2W(ch) (UINT64)(CHAR_UPPER4W(ch) & 0x00000000FFFFFFFF)
#define CHAR_UPPER1W(ch) (UINT64)(CHAR_UPPER4W(ch) & 0x000000000000FFFF)

#define _CHAR_UPPER4(ch) (UINT32)((ch) & 0xDFDFDFDF)
#define CHAR_UPPER4(ch) (UINT32)_CHAR_UPPER4((UInt32)(ch))
#define CHAR_UPPER3(ch) (UINT32)(CHAR_UPPER4(ch) & 0x00FFFFFF)
#define CHAR_UPPER2(ch) (UINT32)(CHAR_UPPER4(ch) & 0x0000FFFF)
#define CHAR_UPPER1(ch) (UINT32)(CHAR_UPPER4(ch) & 0x000000FF)
#define CHAR_UPPER8(ch) ((UINT64)(ch) & 0xDFDFDFDFDFDFDFDF)

#define _TAG2(s) ((((s) << 8) | ((s) >> 8)) & 0xFFFF)
#define TAG2(s) _TAG2((UINT16)(s))

#define _TAG3(s) ( \
                (((s) >> 16) & 0xFF)       | \
                (((s)        & 0xFF00))    | \
                (((s) << 16) & 0x00FF0000) \
                )

#define TAG3(s) _TAG3((UINT32)(s))

#define _TAG4(s) ( \
                (((s) >> 24) & 0xFF)       | \
                (((s) >> 8 ) & 0xFF00)     | \
                (((s) << 24) & 0xFF000000) | \
                (((s) << 8 ) & 0x00FF0000) \
                )

#define TAG4(s) _TAG4((UINT32)(s))
#define TAG8(left, right) (((UINT64)TAG4(right) << 32) | TAG4(left))

#define _TAG2W(x) (((x) & 0xFF) << 16 | ((x) & 0xFF00) >> 8)
#define TAG2W(x) (UINT32)_TAG2W((UINT32)(x))

#define _TAG3W(x) (TAG4W(x) >> 16)
#define TAG3W(x) (UINT64)_TAG3W((UINT64)(x))

#define _TAG4W(x) (((UINT64)TAG2W((x) & 0xFFFF) << 32) | ((UINT64)TAG2W((x) >> 16)))
#define TAG4W(x) (UINT64)_TAG4W((UINT64)(x))

#define SWAP2(v) (UINT16)(((UINT32)(v) << 8) | ((UINT16)(v) >> 8))
#define SWAPCHAR(v) ((UINT32)SWAP2(v))

#define LoByte(v)  (UINT8) ((v & 0xFF))
#define HiByte(v)  (UINT8) (((v) >> 8) & 0xFF)
#define LoWord(v)  (UINT16)((v) & 0xFFFF)
#define HiWord(v)  (UINT16)(((v) >> 16) & 0xFFFF)
#define LoDword(v) (UINT32)((v))
#define HiDword(v) (UINT32)(((v) >> 32))

#define MakeLong(l, h)   (LONG)((LONG)(l) | ((LONG)(h) << 16))
#define MakeLong64(l, h) (LONGLONG)((LONGLONG)(l) | (LONGLONG)(h) << 32)

#define MakeDword(l, h) (ULONG)((ULONG)(l) | ((ULONG)(h) << 16))
#define MakeQword(l, h) (ULONGLONG)((ULONGLONG)(l) | (ULONGLONG)(h) << 32)

#if !defined(NtCurrentProcess)
#define NtCurrentProcess() (HANDLE)-1
#define NtCurrentProcess64() (HANDLE64)-1
#endif /* NtCurrentProcess */

#if !defined(NtCurrentThread)
#define NtCurrentThread() (HANDLE)-2
#define NtCurrentThread64() (HANDLE64)-2
#endif /* NtCurrentThread */

#ifndef NT_SUCCESS

__forceinline BOOL IsStatusSuccess(NTSTATUS Status) { return (Status & Status) >= 0; }
//    #define NT_SUCCESS(Status)  (((NTSTATUS)(Status)) >= 0)
#define NT_SUCCESS(Status)  IsStatusSuccess(Status)
#endif /* NT_SUCCESS */

#ifndef NT_FAILED
#define NT_FAILED !NT_SUCCESS
#endif // NT_FAILED

#if !defined(FAIL_RETURN)
#define FAIL_RETURN(Status) { NTSTATUS __Status__;  __Status__ = (Status); if (!NT_SUCCESS(__Status__)) return __Status__; }
#define FAIL_CONTINUE(Status) if (!NT_SUCCESS(Status)) continue
#define FAIL_BREAK(Status) if (!NT_SUCCESS(Status)) break
#define SUCCESS_RETURN(Status) { NTSTATUS __Status__;  __Status__ = (Status); if (NT_SUCCESS(__Status__)) return __Status__; }
#endif  // FAIL_RETURN

#if defined(ForceInline)
#undef ForceInline
#endif

#define ForceInline __forceinline

#if defined(FASTCALL)
#undef FASTCALL
#endif

#define FASTCALL __fastcall



#define IMAGE_INVALID_ORDINAL   ((ULONG_PTR)(~0ull))

#define IMAGE_INVALID_RVA       ((ULONG_PTR)(~0ui64))
#define IMAGE_INVALID_VA        ((PVOID)(~0ui64))
#define IMAGE_INVALID_OFFSET    IMAGE_INVALID_RVA
#define IMAGE_MINIMUM_ADDRESS   (ULONG_PTR)0x10000

#define IMAGE_NTHEADERS(_ImageBase) ((PIMAGE_NT_HEADERS)PtrAdd((_ImageBase), (_ImageBase)->e_lfanew))

#define IMAGE_SECTION_BASE(_Section)    ((_Section)->VirtualAddress)
#define IMAGE_SECTION_SIZE(_Section)    ((_Section)->Misc.VirtualSize)
#define IMAGE_SECTION_TAIL(_Section)    (IMAGE_SECTION_BASE(_Section) + IMAGE_SECTION_SIZE(_Section))
#define IMAGE_SECTION_TAIL_ALIGN(_Section, _SectionAlignment) ROUND_UP(IMAGE_SECTION_TAIL(_Section), _SectionAlignment)

enum
{
	IMAGE_VALID_EXPORT_ADDRESS_TABLE = 0x00000001,
	IMAGE_VALID_IMPORT_ADDRESS_TABLE = 0x00000002,
	IMAGE_VALID_RESOURCE = 0x00000004,
	IMAGE_VALID_RELOC = 0x00000008,
};


#define EXTC_IMPORT extern "C" __declspec(dllimport)

EXTC_IMPORT
BOOL
WINAPI
CreateProcessInternalW(
	HANDLE                  Token,
	PCWSTR                  ApplicationName,
	PWSTR                   CommandLine,
	LPSECURITY_ATTRIBUTES   ProcessAttributes,
	LPSECURITY_ATTRIBUTES   ThreadAttributes,
	BOOL                    InheritHandles,
	DWORD                   CreationFlags,
	LPVOID                  Environment,
	PCWSTR                  CurrentDirectory,
	LPSTARTUPINFOW          StartupInfo,
	LPPROCESS_INFORMATION   ProcessInformation,
	PHANDLE                 NewToken
);

PVOID LookupImportTable(PVOID ImageBase, PCSTR DllName, PCSTR RoutineName);
PVOID LookupImportTable(PVOID ImageBase, PCSTR DllName, ULONG Hash);


BOOL
IsValidImage(
	PVOID       ImageBase,
	ULONG_PTR   DEF_VAL(Flags, 0)
);


PVOID
GetImageBaseAddress(
	PVOID ImageAddress
);

inline PIMAGE_NT_HEADERS ImageNtHeadersFast(PVOID ImageBase, PULONG_PTR NtHeadersVersion = nullptr)
{
	PIMAGE_NT_HEADERS32 NtHeaders32;

	NtHeaders32 = (PIMAGE_NT_HEADERS32)((ULONG_PTR)ImageBase + ((PIMAGE_DOS_HEADER)ImageBase)->e_lfanew);

	if (NtHeadersVersion != nullptr) switch (NtHeaders32->OptionalHeader.Magic)
	{
	case IMAGE_NT_OPTIONAL_HDR32_MAGIC:
	case IMAGE_NT_OPTIONAL_HDR64_MAGIC:
		*NtHeadersVersion = NtHeaders32->OptionalHeader.Magic;
		break;

	default:
		return nullptr;
	}

	return (PIMAGE_NT_HEADERS)NtHeaders32;
}

inline PIMAGE_NT_HEADERS ImageNtHeaders(PVOID ImageBase, PULONG_PTR NtHeadersVersion = nullptr)
{
	if (!IsValidImage(ImageBase))
		return nullptr;

	return ImageNtHeadersFast(ImageBase, NtHeadersVersion);
}


typedef const LDR_DATA_TABLE_ENTRY* PCLDR_DATA_TABLE_ENTRY;

typedef LDR_DATA_TABLE_ENTRY LDR_MODULE;
typedef PLDR_DATA_TABLE_ENTRY PLDR_MODULE;
typedef PCLDR_DATA_TABLE_ENTRY PCLDR_MODULE;


ForceInline void* AllocStack(size_t Size)
{
	return _alloca(ROUND_UP(Size, 16));
	return _alloca(ROUND_UP(Size, 16));
}


#define DELAY_ONE_MICROSECOND   (-10)
#define DELAY_ONE_MILLISECOND   (DELAY_ONE_MICROSECOND * 1000)
#define DELAY_ONE_SECOND        (DELAY_ONE_MILLISECOND * 1000)
#define DELAY_QUAD_INFINITE     0x8000000000000000ll

inline PLARGE_INTEGER FormatTimeOut(PLARGE_INTEGER TimeOut, ULONG Milliseconds)
{
	if (Milliseconds == INFINITE)
	{
		//TimeOut->LowPart = 0;
		//TimeOut->HighPart = 0x80000000;
		TimeOut->QuadPart = DELAY_QUAD_INFINITE;
	}
	else
	{
		TimeOut->QuadPart = DELAY_ONE_MILLISECOND * (LONG64)Milliseconds;
	}

	return TimeOut;
}

NTSTATUS
ExceptionBox(
	PCWSTR      Text,
	PCWSTR      Title = nullptr,
	PULONG_PTR  Response = nullptr,
	ULONG_PTR   Type = MB_ICONASTERISK | MB_OK
);

inline LONG_PTR InitNext(const VOID *lpKeyWord, LONG_PTR KeyWordLen, PLONG_PTR piNext)
{
	LONG_PTR i, j;
	const CHAR *pDest;

	pDest = (PCCHAR)lpKeyWord;

	piNext[0] = -1;
	i = 0;
	j = (LONG_PTR)-1;

	while (i < KeyWordLen)
	{
		if (j == -1 || pDest[i] == pDest[j])
		{
			if (pDest[++i] != pDest[++j])
			{
				piNext[i] = j;
			}
			else
			{
				piNext[i] = piNext[j];
			}
		}
		else
		{
			j = piNext[j];
		}
	}

	return KeyWordLen;
}

inline PVOID KMP(const PVOID _Src, LONG_PTR SrcLength, const PVOID _KeyWord, LONG_PTR KeyWordLen)
{
	LONG_PTR i, j;
	PLONG_PTR  Next;//[100];
	PLONG_PTR pNext;
	const CHAR *pSrc, *pKeyWord;

	if (SrcLength == 0)
		return nullptr;

	Next = (PLONG_PTR)AllocStack((KeyWordLen + 1) * sizeof(*pNext));
	pNext = Next;
	pSrc = (const CHAR *)_Src;
	pKeyWord = (const CHAR *)_KeyWord;
	InitNext(_KeyWord, KeyWordLen, pNext);
	i = 0;
	j = 0;
	while (i != SrcLength && j != KeyWordLen)
	{
		if (j == -1 || pSrc[i] == pKeyWord[j])
		{
			++i;
			++j;
		}
		else
		{
			j = pNext[j];
		}
	}

	if (i == SrcLength && j != KeyWordLen)
		return nullptr;

	return (VOID *)(pSrc + i - KeyWordLen);
}


template<class PtrType>
ForceInline
PtrType GetCallDestination(PtrType Buffer)
{
	union
	{
		PtrType     Pointer;
		ULONG_PTR   Value;
	};

	Pointer = Buffer;
	Value = *(PLONG)(Value + 1) + Value + sizeof(ULONG) + 1;

	return Pointer;
}

ULONG_PTR FASTCALL LdeGetOpCodeSize32(PVOID Code, PVOID *OpCodePtr = NULL);
ULONG_PTR FASTCALL LdeGetOpCodeSize64(PVOID Code, PVOID *OpCodePtr = NULL);

ForceInline ULONG_PTR GetOpCodeSize32(PVOID Buffer)
{
	return LdeGetOpCodeSize32(Buffer);
}

ForceInline ULONG_PTR GetOpCodeSize64(PVOID Buffer)
{
	return LdeGetOpCodeSize64(Buffer);
}

PVOID
Nt_LoadLibrary(
	PWSTR ModuleFileName
);

PVOID
FASTCALL
Nt_GetProcAddress(
	PVOID ModuleBase,
	PCSTR ProcedureName
);


ULONG
Nt_GetExeDirectory(
	PWSTR Path,
	ULONG BufferCount
);


PVOID
Nt_GetModuleHandle(
	LPCWSTR lpModuleName
);

NTSTATUS
Nt_CreateThread(
	PVOID                   StartAddress,
	PVOID                   DEF_VAL(StartParameter, NULL),
	BOOL                    DEF_VAL(CreateSuspended, FALSE),
	HANDLE                  DEF_VAL(ProcessHandle, NtCurrentProcess()),
	PHANDLE                 DEF_VAL(ThreadHandle, NULL),
	PCLIENT_ID              DEF_VAL(ClientID, NULL),
	ULONG                   DEF_VAL(StackZeroBits, 0),
	ULONG                   DEF_VAL(StackReserved, 0),
	ULONG                   DEF_VAL(StackCommit, 0),
	PSECURITY_DESCRIPTOR    DEF_VAL(SecurityDescriptor, NULL)
);


NTSTATUS
Nt_CreateProcess(
	HANDLE                  Token,
	PCWSTR                  ApplicationName,
	PWSTR                   DEF_VAL(CommandLine, NULL),
	PCWSTR                  DEF_VAL(CurrentDirectory, NULL),
	ULONG                   DEF_VAL(CreationFlags, 0),
	LPSTARTUPINFOW          DEF_VAL(StartupInfo, NULL),
	LPPROCESS_INFORMATION   DEF_VAL(ProcessInformation, NULL),
	LPSECURITY_ATTRIBUTES   DEF_VAL(ProcessAttributes, NULL),
	LPSECURITY_ATTRIBUTES   DEF_VAL(ThreadAttributes, NULL),
	PVOID                   DEF_VAL(Environment, NULL)
);


ULONG
Nt_WaitForSingleObjectEx(
	IN HANDLE hHandle,
	IN ULONG  Milliseconds,
	IN BOOL   bAlertable
);

inline ULONG_PTR ReadFsPtr(ULONG_PTR Offset)
{
#if defined(_AMD64_)
	return (ULONG_PTR)__readgsqword((ULONG)Offset);
#else // x86
	return (ULONG_PTR)__readfsdword(Offset);
#endif
}


#define TEB_OFFSET FIELD_OFFSET(TEB, NtTib.Self)
#define PEB_OFFSET FIELD_OFFSET(TEB, ProcessEnvironmentBlock)

ForceInline
PPEB Nt_CurrentPeb()
{
	return (PPEB)(ULONG_PTR)ReadFsPtr(PEB_OFFSET);
}


ForceInline PTEB Nt_CurrentTeb()
{
	return (PTEB)ReadFsPtr(TEB_OFFSET);
}

ULONG_PTR   PrintConsoleA(PCSTR Format, ...);
ULONG_PTR   PrintConsoleW(PCWSTR Format, ...);


ForceInline
VOID
SetLastNTError(
	NTSTATUS Status
)
{
	RtlSetLastWin32ErrorAndNtStatusFromNtStatus(Status);
}


LONG_PTR    FASTCALL CmdLineToArgvWorkerA(LPSTR pszCmdLine, LPSTR *pArgv, PLONG_PTR pCmdLineLength);
PSTR*       FASTCALL CmdLineToArgvA(LPSTR pszCmdLine, PLONG_PTR pArgc);
LONG_PTR    FASTCALL CmdLineToArgvWorkerW(LPWSTR pszCmdLine, LPWSTR *pArgv, PLONG_PTR pCmdLineLength);
PWSTR*      FASTCALL CmdLineToArgvW(LPWSTR pszCmdLine, PLONG_PTR pArgc);

inline VOID ReleaseArgv(PVOID Argv)
{
	HeapFree(GetProcessHeap(), 0, Argv);
}

#pragma pack(push, 1)

typedef struct
{
	UINT16 Tag;                   // 0x00
	UINT32 FileSize;             // 0x02
	UINT32 Reserve;              // 0x06
	UINT32 RawOffset;            // 0x0A
	struct
	{
		UINT32 InfoHeaderSize;   // 0x0E
		INT32  Width;            // 0x12
		INT32  Height;           // 0x16
		UINT16 Layer;             // 0x1A
		UINT16 Bit;               // 0x1C
		UINT32 Compressed;       // 0x1E
		UINT32 SizeImage;        // 0x22
		INT32  XPelsPerMeter;     // 0x26
		INT32  YPelsPerMeter;     // 0x2A
		UINT32 ClrUsed;          // 0x2E
		UINT32 ClrImportant;     // 0x32
	} Info;
} IMAGE_BITMAP_HEADER, *PIMAGE_BITMAP_HEADER;

enum
{
	TgaImageRga = 2,
};

typedef struct
{
	UCHAR  ID;
	UCHAR  PaletteType;
	UCHAR  ImageType;
	UINT16 PaletteEntry;
	UINT16 PaletteLength;
	UCHAR  PaletteBitCount;
	UINT16 OriginX;
	UINT16 OriginY;
	UINT16 Width;
	UINT16 Height;
	UCHAR  PixelDepth;
	UCHAR  ImageDescription;

} IMAGE_TGA_HEADER, *PIMAGE_TGA_HEADER;

typedef struct
{
	UCHAR   Width;
	UCHAR   Height;
	UCHAR   NumberOfColorInPalette;
	UCHAR   Reserve;

	union
	{
		struct
		{
			USHORT  Planes;
			USHORT  BitsPerPixel;
		} Ico;

		struct
		{
			USHORT  X;
			USHORT  Y;
		} Cur;
	};

	ULONG ImageSize;
	ULONG ImageOffset;

} IMAGE_ICO_IMAGE_ENTRY, *PIMAGE_ICO_IMAGE_ENTRY;

typedef struct
{
	USHORT Reserve;
	USHORT FileType;   // 1
	USHORT NumberOfImage;

	IMAGE_ICO_IMAGE_ENTRY   Entry[1];

} IMAGE_ICO_HEADER, *PIMAGE_ICO_HEADER;

#pragma pack(pop)



